
intxt = input("请输入明文：")
for p in intxt:
    if "a" <= p <= "z":
        print(chr(ord("a")+(ord(p)-ord("a")-3)%26),end="")
    elif "A" <= p <= "Z":
        print(chr(ord("A")+(ord(p)-ord("A")-3)%26),end="")
    else:
        print(p,end="")
"""
    这个地方你看 
        就是字符输进去ascii码的值 要-3  d开始就不说了 d是 3-3%26 = 0 所以是a e = 4-3%26 =1 所以是b
        重点看abc
            a输进去 a(97)+(97-97-3)%26  = 97+23 = 120 = x  为什么会这样呢
            -3%26 = 23 注意也就说
                假设 -3%26 = x   x-(-3) = 26  
                负数和正数取余数的结果就是  x-(-3) = 26   满足这个公式 就是23 
            也就是说取a的递推后面三位 就是往前+23 
            也就是说我一开始想的也没有问题 就是往前+ 就是不知道这个公式 
"""